import {Rating} from "@mui/material";
import React from "react";
import Image from "next/image";
import Link from "next/link";
import Cta from "@/components/modules/blog/Cta";

const BlogContent = () => {
    return (
        <div className="flex flex-col items-center">
            <div className="flex flex-col items-center gap-3">
                <h1 className="text-blue-dark text-2xl font-bold">نبات چیست؟</h1>
                <span className="text-sm font-[700] text-gray-400">14 اسفند 1402</span>
                <Rating name="read-only" value={4} readOnly
                        icon={<i className="fa-solid fa-star text-base"></i>}
                        emptyIcon={<i className="fa-duotone fa-star text-base"></i>}
                        style={{
                            gap: "3px"
                        }}
                />
            </div>
            <div className="w-full max-w-screen-sm leading-relaxed text-justify blogContainer">
                <div className="relative aspect-video rounded-2xl overflow-hidden mt-5">
                    <Image src="/testImages/text.webp" alt="blogImage" fill
                           className="object-cover object-bottom"/>
                </div>
                <h2>
                    داشتن مادربزرگی که برات چایی‌نبات بریزه، چند نسل قدمت داره؟
                </h2>
                <p>
                    نبات عضو پایدار خانه‌های ایرانی است و آشنا برای اغلب مردم. «نبات چیست؟» سوالی ساده و نادر است و اغلب
                    پاسخی شفاف دارد. نبات بلور ساخته شده از محلول اشباع شده شکر و آب است که مزه‌ای شیرین دارد. برای ما
                    در بی بی نبات اما، نبات در این چند کلمه مختصر معنا نمی‌شود. نبات بخشی از فرهنگ و تاریخ ایران است که
                    از مادربزرگان و پدربزرگان ما به جا مانده است. خوراکی ساده‌ای که از تاریخ به جا مانده و داستان‌هایی
                    زیادی با عطر و طعم‌های مختلف همراه خود دارد. در این مقاله قصد داریم از تاریخ نبات صحبت کنیم و با
                    ترکیبات آن آشنا شویم.
                </p>
                <div className="relative aspect-video rounded-2xl overflow-hidden mt-5">
                    <Image src="/testImages/pm4.jpg" alt="blogImage" fill
                           className="object-cover object-bottom"/>
                </div>
                <h2>
                    خاستگاه نبات
                </h2>
                <p>
                    قرن‌ها خوراکی‌های شیرین در عسل و میوه‌ها خلاصه می‌شدند تا زمانی که مردم دریافتند چطور از نیشکر، ماده
                    خوراکی شیرین شکر را بسازند. در قرن 18 میلادی، در اروپا، شکر کالایی لوکس و مخصوص اشراف بود که از شرق
                    به کشورهای اروپایی صادر می‌شد. در شرق اما، کاشت و برداشت نیشکر و تولید شکر از آن، رایج بود.
                </p>
                <p>
                    شواهد تاریخی نشان می‌دهد هندی‌ها اولین مردمانی بودند که شیره نیشکر را در آب می‌جوشاندند و از آن نبات
                    می‌گرفتند. نباتی که نیمه جامد، کدر و کمی تیره رنگ بود و بلورهای کوچکی داشت. برخی از انواع تصفیه
                    محلول آب و شکر، بلورهای زیباتر و بزرگتری را به همراه داشت تا زمانی که نبات فرم امروزی خودش را پیدا
                    کرد.
                </p>
                <p>
                    همان‌طور که از فرهنگ و آشپزی مردمان هند انتظار می‌رود، هندی‌ها گیاهان مختلفی را در ترکیب نبات
                    استفاده کردند و خواص و طعم‌های جدید به نبات دادند.
                </p>
                <p>
                    نبات با سرعتی بسیار کم به ایران، یونان و روم رسید. تجار نبات را با اسم شکر هندی، با قیمتی بسیار بالا
                    برای اشراف‌زادگان و پادشاهان می‌فروختند.
                </p>
                <p>
                    مدتی بعد نبات به ایران رسید و ایرانیان به سبک و سیاق خود، در ساخت، عطر و طعم نبات تحولاتی ایجاد
                    کردند که باعث شد امروزه دومین خاستگاه نبات را (در شکل امروزی) ایران بدانیم. ترکیب بادام کوبیده شده و
                    گلاب با محلول آب و شکر، یکی از انواع نبات تولید شده توسط ایرانیان آن زمان است که امروزه نیز به شکل
                    شکلات در اروپا تولید می‌شود. ابداع تافی (نبات با بافت جویدنی) نیز در اواخر قرن 18 میلادی با ایجاد
                    کمی تغییر در در فرآیند تولید نبات، توسط ایران ساخته شد و در دنیا گسترش یافت.
                </p>
                <p>
                    اگر شما نیز تمایل دارید همانند ایرانیان دورزمان، در خانه نبات درست کنید، در مقاله <Link href="/">طرز
                    تهیه نبات یزدی </Link>
                    به شما راهنمایی لازم برای این کار را داده‌ایم. از لینک زیر بخوانید:
                </p>
                <Cta/>
                <h2>
                    انواع طعم‌‌ها و ترکیبات نبات
                </h2>
                <p>
                    استفاده از نبات برای درمان بیماری‌ها نیز از هند و ایران آغاز شد. گیاهان خوش‌عطر، خوش‌طعم و خوش‌رنگ،
                    آجیل‌ها، میوه‌های خشک، سبزیجات و حتی گیاهان دارویی با نبات ترکیب می‌شدند و مصارف خوراکی و دارویی
                    داشتند. برخی از آن‌ها همراه با محلول شکر جوشانده می‌شدند و برخی نیز در روند تبلور اضافه می‌شدند.
                    طعم‌هایی از نبات، امروزه نیز برای ما آشنا هستند، مثل:
                </p>
                <ul>
                    <li>نبات و زعفران</li>
                    <li>نبات گل‌محمدی</li>
                    <li>نبات هل‌دار</li>
                    <li>نبات زجبیلی</li>
                    <li>و ...</li>
                </ul>
                <p>
                    طعم بسیار خوب، تمایل مردم از پیر تا جوان به مصرف نبات و خواص درمانی هر کدام از گیاهان ترکیب شده با
                    نبات، باعث شد اطبای ایرانی مصرف انواع نبات را برای بیماری‌های مختلف توصیه کنند. در نهایت نبات به
                    خوراکی محبوب و دارویی پرکاربرد در ایران تبدیل شد و احتمالا در همین حوالی تاریخ بود که مادرها و
                    مادربزرگ‌ها برای دردهای کوچک و بزرگ خانه‌هایشان به چایی نبات روی آوردند.
                </p>
                <p>
                    طعم بسیار خوب، تمایل مردم از پیر تا جوان به مصرف نبات و خواص درمانی هر کدام از گیاهان ترکیب شده با
                    نبات، باعث شد اطبای ایرانی مصرف انواع نبات را برای بیماری‌های مختلف توصیه کنند. در نهایت نبات به
                    خوراکی محبوب و دارویی پرکاربرد در ایران تبدیل شد و احتمالا در همین حوالی تاریخ بود که مادرها و
                    مادربزرگ‌ها برای دردهای کوچک و بزرگ خانه‌هایشان به چایی نبات روی آوردند.
                </p>
                <p>
                    در این مقاله از تاریخ و گذشته نبات صحبت کردیم، در تاریخ قدم زدیم، عطر تند ادویه‌های هندی تا بوی خوش
                    گلاب ایرانی در نبات را دنبال کردیم تا به نبات زعفرانی حل شده در چای خانه‌های مادربزرگ‌ها رسیدیم.
                    نبات خوش‌طعم اصیل ایرانی را می‌توانید از ما، در بی‌بی نبات تهیه کنید. تضمین می‌کنیم که نبات‌های ما
                    عطر و بوی این تاریخ را تا خانه‌های شما با خود بیاورند. برای <Link href="/">خرید نبات </Link> بر روی
                    دکمه زیر کلیک کنید.
                </p>
            </div>
        </div>
    );
};

export default BlogContent;